
. 
. 
. * ssc install synth, replace
. 
. * Estimation 1: Texas model of black male prisoners (per capita)
. use ../data/texas.dta, replace

. 
. 
. 
. #delimit;
delimiter now ;
. synth   bmprison 
>                 bmprison(1990) bmprison(1992) bmprison(1991) bmprison(1988)
>                 alcohol(1990) aidscapita(1990) aidscapita(1991) 
>                 income ur poverty black(1990) black(1991) black(1992) 
>                 perc1519(1990)
>                 ,               
>                 trunit(48) trperiod(1993) unitnames(state) 
>                 mspeperiod(1985(1)1993) resultsperiod(1985(1)2000)
>                 keep(../data/synth/synth_bmprate.dta) replace fig;
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Texas
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  1295.489 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .408
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |        .109
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |         .36
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |        .122
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     22634    23134.8 
                bmprison(1992) |     27568   25776.34 
                bmprison(1991) |     23249   24272.24 
                bmprison(1988) |     16956   18374.28 
                 alcohol(1990) |      2.47    2.70996 
              aidscapita(1990) |  13.58992   14.99957 
              aidscapita(1991) |  14.83504   17.24535 
                        income |  16108.63   18614.54 
                            ur |  7.426042   7.188876 
                       poverty |      17.2   14.86484 
                   black(1990) |  16.15459   15.98038 
                   black(1991) |  16.29985   16.16835 
                   black(1992) |  16.45955   16.37467 
                perc1519(1990) |  7.703001   7.022702 
------------------------------------------------------
--------------------------------------------------------------------------------

.                 mat list e(V_matrix);

symmetric e(V_matrix)[14,14]
                   bmprison(      bmprison(      bmprison(      bmprison(
                       1990)          1992)          1991)          1988)
     bmprison(
        1990)      .04203396
     bmprison(
        1992)              0      .14521907
     bmprison(
        1991)              0              0      .05565401
     bmprison(
        1988)              0              0              0       .0412083
alcohol(1990)              0              0              0              0
   aidscapita(
        1990)              0              0              0              0
   aidscapita(
        1991)              0              0              0              0
       income              0              0              0              0
           ur              0              0              0              0
      poverty              0              0              0              0
  black(1990)              0              0              0              0
  black(1991)              0              0              0              0
  black(1992)              0              0              0              0
     perc1519(
        1990)              0              0              0              0

                                aidscapita(    aidscapita(                
               alcohol(1990)          1990)          1991)         income
alcohol(1990)      .00001507
   aidscapita(
        1990)              0      .01537127
   aidscapita(
        1991)              0              0      .01617833
       income              0              0              0      .00005753
           ur              0              0              0              0
      poverty              0              0              0              0
  black(1990)              0              0              0              0
  black(1991)              0              0              0              0
  black(1992)              0              0              0              0
     perc1519(
        1990)              0              0              0              0

                                                                          
                          ur        poverty    black(1990)    black(1991)
           ur      .00002568
      poverty              0      .00007734
  black(1990)              0              0      .17576799
  black(1991)              0              0              0      .44121217
  black(1992)              0              0              0              0
     perc1519(
        1990)              0              0              0              0

                                  perc1519(
                 black(1992)          1990)
  black(1992)       .0671646
     perc1519(
        1990)              0      .00001468

. #delimit cr
delimiter now cr
. 
. graph save Graph ../Figures/synth_tx.gph, replace
(file ../Figures/synth_tx.gph not found)
file ../Figures/synth_tx.gph saved

. 
. 
. * Plot the gap in predicted error
. use ../data/synth/synth_bmprate.dta, clear

. keep _Y_treated _Y_synthetic _time

. drop if _time==.
(34 observations deleted)

. rename _time year

. rename _Y_treated  treat

. rename _Y_synthetic counterfact

. gen gap48=treat-counterfact

. sort year 

. twoway (line gap48 year,lp(solid)lw(vthin)lcolor(black)), yline(0, lpattern(sh
> ortdash) lcolor(black)) xline(1993, lpattern(shortdash) lcolor(black)) xtitle(
> "",si(medsmall)) xlabel(#10) ytitle("Gap in black male prisoner prediction err
> or", size(medsmall)) legend(off)

. save ../data/synth/synth_bmprate_48.dta, replace
(file ../data/synth/synth_bmprate_48.dta not found)
file ../data/synth/synth_bmprate_48.dta saved

. 
. 
. * Inference 1 placebo test
. #delimit;
delimiter now ;
. set more off;

. use ../data/texas.dta, replace;

. local statelist  1 2 4 5 6 8 9 10 11 12 13 15 16 17 18 20 21 22 23 24 25 26 27
>  28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 45 46 47 48 49 51 53 55;

. foreach i of local statelist {;
  2. synth   bmprison 
>                 bmprison(1990) bmprison(1992) bmprison(1991) bmprison(1988)
>                 alcohol(1990) aidscapita(1990) aidscapita(1991) 
>                 income ur poverty black(1990) black(1991) black(1992) 
>                 perc1519(1990)
>                 ,               
>                         trunit(`i') trperiod(1993) unitnames(state) 
>                         mspeperiod(1985(1)1993) resultsperiod(1985(1)2000)
>                         keep(../data/synth/synth_bmprate_`i'.dta) replace;
  3.                         matrix state`i' = e(RMSPE);
  4.  /* check the V matrix*/
>                         };
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Alabama
               Control Units: Alaska, Arizona, Arkansas, California, Colorado,
                              Connecticut, Delaware, District of Columbia,
                              Florida, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  363.9074 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
              Alaska |           0
             Arizona |           0
            Arkansas |        .112
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |        .051
           Minnesota |           0
         Mississippi |        .483
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |        .263
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |        .091
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      9282     9143.4 
                bmprison(1992) |     10660   10634.13 
                bmprison(1991) |     10119    10153.1 
                bmprison(1988) |      7244   7371.444 
                 alcohol(1990) |      1.92    2.12356 
              aidscapita(1990) |  4.370311   5.220406 
              aidscapita(1991) |   5.92805   5.766748 
                        income |  14321.88    14028.8 
                            ur |  7.371875   8.148177 
                       poverty |      19.9   19.74956 
                   black(1990) |  25.59587    25.5272 
                   black(1991) |  25.70243   25.70213 
                   black(1992) |  25.87369   25.90313 
                perc1519(1990) |  7.868362    8.00149 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Alaska
               Control Units: Alabama, Arizona, Arkansas, California, Colorado,
                              Connecticut, Delaware, District of Columbia,
                              Florida, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  224.5887 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |        .195
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |        .082
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |        .723
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |       288    525.533 
                bmprison(1992) |       327    562.782 
                bmprison(1991) |       314    559.489 
                bmprison(1988) |       271    466.532 
                 alcohol(1990) |      3.33    2.62585 
              aidscapita(1990) |   1.80737   2.390603 
              aidscapita(1991) |  3.332205   3.894373 
                        income |  21346.38   16573.28 
                            ur |      8.85   6.268185 
                       poverty |    10.875   12.11233 
                   black(1990) |   5.03644   4.884086 
                   black(1991) |  4.953708   4.970572 
                   black(1992) |  5.162543   5.136264 
                perc1519(1990) |  6.837102   7.553331 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Arizona
               Control Units: Alabama, Alaska, Arkansas, California, Colorado,
                              Connecticut, Delaware, District of Columbia,
                              Florida, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  58.05471 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
            Arkansas |           0
          California |           0
            Colorado |        .001
         Connecticut |           0
            Delaware |           0
District of Columbia |        .017
             Florida |        .037
             Georgia |           0
              Hawaii |         .03
               Idaho |        .102
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |        .166
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |        .003
          New Jersey |           0
          New Mexico |        .109
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .499
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .037
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      2283   2325.785 
                bmprison(1992) |      2654   2660.287 
                bmprison(1991) |      2432   2440.734 
                bmprison(1988) |      1775   1806.841 
                 alcohol(1990) |      2.77    2.53201 
              aidscapita(1990) |  8.143108   8.100142 
              aidscapita(1991) |  8.631211   8.673619 
                        income |  15906.63   16079.63 
                            ur |  6.205208   6.480389 
                       poverty |   13.7875    13.4658 
                   black(1990) |  3.869853    3.91583 
                   black(1991) |  3.971641   3.983432 
                   black(1992) |  4.031487   4.044212 
                perc1519(1990) |  7.110507    7.02563 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Arkansas
               Control Units: Alabama, Alaska, Arizona, California, Colorado,
                              Connecticut, Delaware, District of Columbia,
                              Florida, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  241.5296 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |        .039
              Alaska |           0
             Arizona |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |        .188
            Missouri |           0
             Montana |        .113
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |         .12
           Tennessee |        .505
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |        .035
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |    3648.5   3677.247 
                bmprison(1992) |      4449   4393.639 
                bmprison(1991) |      4171   4216.063 
                bmprison(1988) |      2646   2716.446 
                 alcohol(1990) |      1.86    2.09843 
              aidscapita(1990) |   3.18257   3.612951 
              aidscapita(1991) |  4.615751   4.620188 
                        income |  13441.25   14380.58 
                            ur |   7.61875   6.997796 
                       poverty |   20.0375   18.51864 
                   black(1990) |  16.17308   16.11828 
                   black(1991) |  16.21316   16.21935 
                   black(1992) |  16.28474   16.34933 
                perc1519(1990) |  7.611859   7.640381 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: California
               Control Units: Alabama, Alaska, Arizona, Arkansas, Colorado,
                              Connecticut, Delaware, District of Columbia,
                              Florida, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  5416.415 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |          .4
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |          .6
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     32190    25145.2 
                bmprison(1992) |     34279    28317.6 
                bmprison(1991) |     32981    26705.6 
                bmprison(1988) |     26438      19901 
                 alcohol(1990) |      2.78      2.564 
              aidscapita(1990) |  20.33744   30.55298 
              aidscapita(1991) |  22.40839   35.13135 
                        income |  19904.63   19820.55 
                            ur |  6.645833   6.158125 
                       poverty |   13.8375      14.03 
                   black(1990) |  11.10237   16.44625 
                   black(1991) |  11.26896   16.71009 
                   black(1992) |  11.42323   16.99763 
                perc1519(1990) |  6.938607   6.568892 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Colorado
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Connecticut, Delaware, District of Columbia,
                              Florida, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  222.9233 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |         .02
             Florida |           0
             Georgia |           0
              Hawaii |        .049
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |        .189
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .345
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |        .398
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      1525    1610.48 
                bmprison(1992) |      1912   1891.585 
                bmprison(1991) |      1801   1758.561 
                bmprison(1988) |      1229    1319.68 
                 alcohol(1990) |      2.39      2.576 
              aidscapita(1990) |  9.704869   9.864455 
              aidscapita(1991) |  11.89802   11.46637 
                        income |   17998.5   18277.95 
                            ur |  6.202083   6.319428 
                       poverty |   11.9625   10.82906 
                   black(1990) |  4.615869   4.626759 
                   black(1991) |  4.692658   4.728685 
                   black(1992) |  4.740485   4.835713 
                perc1519(1990) |  6.828298    6.69884 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Connecticut
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Delaware, District of Columbia, Florida,
                              Georgia, Hawaii, Idaho, Illinois, Indiana, Iowa,
                              Kansas, Kentucky, Louisiana, Maine, Maryland,
                              Massachusetts, Michigan, Minnesota, Mississippi,
                              Missouri, Montana, Nebraska, Nevada, New
                              Hampshire, New Jersey, New Mexico, New York, North
                              Carolina, North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Texas, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  312.2713 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |        .017
             Arizona |           0
            Arkansas |           0
          California |        .013
            Colorado |           0
            Delaware |        .075
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |        .149
       Massachusetts |        .499
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |        .201
          New Jersey |        .047
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      4818   4598.224 
                bmprison(1992) |      4897   5011.218 
                bmprison(1991) |      4856   4814.672 
                bmprison(1988) |      3541   3532.833 
                 alcohol(1990) |      2.46    2.98639 
              aidscapita(1990) |  10.11553   10.09346 
              aidscapita(1991) |  12.26197   12.37703 
                        income |  23917.75   20696.32 
                            ur |  4.603125    5.08131 
                       poverty |    6.4375   8.887425 
                   black(1990) |  8.704844   8.767671 
                   black(1991) |  8.951908   8.947011 
                   black(1992) |  9.121269   9.134124 
                perc1519(1990) |    6.4158   6.733286 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Delaware
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, District of Columbia,
                              Florida, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  150.1067 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
District of Columbia |         .04
             Florida |           0
             Georgia |           0
              Hawaii |        .436
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |        .319
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |        .204
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      2102   2244.353 
                bmprison(1992) |      2476   2419.779 
                bmprison(1991) |      2287   2391.401 
                bmprison(1988) |      1823    1958.23 
                 alcohol(1990) |      2.95    2.94456 
              aidscapita(1990) |  10.60387   10.13915 
              aidscapita(1991) |  10.83328   11.43872 
                        income |  19544.25   17311.99 
                            ur |  4.177083   5.683215 
                       poverty |       8.9   14.47936 
                   black(1990) |  17.41505    17.4336 
                   black(1991) |  17.76542   17.68502 
                   black(1992) |  18.07557   18.04307 
                perc1519(1990) |  6.884897   7.238146 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: District of Columbia
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, Florida, Georgia,
                              Hawaii, Idaho, Illinois, Indiana, Iowa, Kansas,
                              Kentucky, Louisiana, Maine, Maryland,
                              Massachusetts, Michigan, Minnesota, Mississippi,
                              Missouri, Montana, Nebraska, Nevada, New
                              Hampshire, New Jersey, New Mexico, New York, North
                              Carolina, North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Texas, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  3174.297 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------
         Co_No | Unit_Weight
---------------+------------
       Alabama |           0
        Alaska |           0
       Arizona |           0
      Arkansas |           0
    California |           0
      Colorado |           0
   Connecticut |           0
      Delaware |           0
       Florida |           0
       Georgia |           0
        Hawaii |           0
         Idaho |           0
      Illinois |           0
       Indiana |           0
          Iowa |           0
        Kansas |           0
      Kentucky |           0
     Louisiana |           0
         Maine |           0
      Maryland |           0
 Massachusetts |           0
      Michigan |           0
     Minnesota |           0
   Mississippi |           1
      Missouri |           0
       Montana |           0
      Nebraska |           0
        Nevada |           0
 New Hampshire |           0
    New Jersey |           0
    New Mexico |           0
      New York |           0
North Carolina |           0
  North Dakota |           0
          Ohio |           0
      Oklahoma |           0
        Oregon |           0
  Pennsylvania |           0
  Rhode Island |           0
South Carolina |           0
  South Dakota |           0
     Tennessee |           0
         Texas |           0
          Utah |           0
       Vermont |           0
      Virginia |           0
    Washington |           0
 West Virginia |           0
     Wisconsin |           0
       Wyoming |           0
----------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      9222       5663 
                bmprison(1992) |      9996       6069 
                bmprison(1991) |      9513       6055 
                bmprison(1988) |      8205       4898 
                 alcohol(1990) |      4.14       2.08 
              aidscapita(1990) |  86.89604   5.661335 
              aidscapita(1991) |  86.54118   5.849004 
                        income |     23333   12036.75 
                            ur |  6.730208   9.372917 
                       poverty |   17.6625    24.9875 
                   black(1990) |  70.21751   35.96339 
                   black(1991) |   70.8131   36.20175 
                   black(1992) |  71.03963   36.46762 
                perc1519(1990) |  6.689674   8.575604 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Florida
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Georgia, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  652.9261 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .168
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |        .171
          New Mexico |           0
            New York |        .282
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .379
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     23824   23523.91 
                bmprison(1992) |     26823   26874.19 
                bmprison(1991) |     25607   24522.34 
                bmprison(1988) |     17510    18535.7 
                 alcohol(1990) |      2.96    2.49466 
              aidscapita(1990) |  22.21999   22.67735 
              aidscapita(1991) |  26.07369   25.37773 
                        income |  17795.25   19221.35 
                            ur |  6.328125    6.55437 
                       poverty |   13.5875   14.36016 
                   black(1990) |  15.32609   15.37609 
                   black(1991) |  15.56852   15.57996 
                   black(1992) |    15.887   15.78611 
                perc1519(1990) |  6.190002   7.126966 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Georgia
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Hawaii, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  277.6978 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .057
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |        .035
             Florida |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |        .276
               Maine |           0
            Maryland |         .15
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |        .032
      North Carolina |        .075
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |        .244
        South Dakota |           0
           Tennessee |           0
               Texas |        .065
                Utah |           0
             Vermont |           0
            Virginia |        .066
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     14025   14047.11 
                bmprison(1992) |     16125   16099.63 
                bmprison(1991) |     15031   14998.89 
                bmprison(1988) |     11429    11405.5 
                 alcohol(1990) |      2.31    2.55177 
              aidscapita(1990) |  13.85007   13.84397 
              aidscapita(1991) |  15.82743   15.87493 
                        income |  16126.88   16568.88 
                            ur |  5.670833   6.639734 
                       poverty |    15.825    16.3182 
                   black(1990) |  27.70583   27.77512 
                   black(1991) |   28.0021   28.01496 
                   black(1992) |  28.29357   28.26888 
                perc1519(1990) |  7.638498    7.42832 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Hawaii
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Idaho, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  662.0145 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |        .091
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |        .084
             Florida |           0
             Georgia |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |        .174
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |        .652
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |       132    852.186 
                bmprison(1992) |       156    928.407 
                bmprison(1991) |       145    879.866 
                bmprison(1988) |       140    763.297 
                 alcohol(1990) |      2.84    2.93575 
              aidscapita(1990) |   9.87884   9.984382 
              aidscapita(1991) |  12.66765   10.29956 
                        income |   19705.5    16914.4 
                            ur |  3.508333   5.787944 
                       poverty |   10.3125   12.58422 
                   black(1990) |  6.939963   7.179452 
                   black(1991) |  7.314233   7.240751 
                   black(1992) |  7.913692   7.323241 
                perc1519(1990) |  6.530722   7.276334 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Idaho
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Illinois,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  13.50596 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |        .439
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |        .278
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |        .283
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |        27     19.706 
                bmprison(1992) |        26     21.384 
                bmprison(1991) |        29      21.34 
                bmprison(1988) |        23     13.292 
                 alcohol(1990) |      2.27      2.494 
              aidscapita(1990) |  2.074312   1.706279 
              aidscapita(1991) |  1.536517    2.06837 
                        income |  14151.63   15018.58 
                            ur |   6.59375   5.599758 
                       poverty |   14.8125   13.47952 
                   black(1990) |  .3334047   .4100525 
                   black(1991) |  .3532274    .418046 
                   black(1992) |  .3640419   .4203534 
                perc1519(1990) |  8.042601   7.175964 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Illinois
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |   334.531 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |        .069
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |        .057
             Georgia |           0
              Hawaii |           0
               Idaho |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |        .251
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |        .038
               Texas |        .313
                Utah |           0
             Vermont |           0
            Virginia |        .271
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     16220   16027.62 
                bmprison(1992) |     19444   19410.99 
                bmprison(1991) |     17501   17409.09 
                bmprison(1988) |     11975   12212.03 
                 alcohol(1990) |      2.62    2.26416 
              aidscapita(1990) |  8.565205   9.072306 
              aidscapita(1991) |  10.59732   10.33121 
                        income |   19050.5   17027.72 
                            ur |  7.367708     6.4977 
                       poverty |   13.9375    14.0596 
                   black(1990) |  16.40337   16.38378 
                   black(1991) |  16.57732   16.55635 
                   black(1992) |  16.77681   16.76344 
                perc1519(1990) |  7.120968   7.322935 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Indiana
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Iowa, Kansas, Kentucky, Louisiana,
                              Maine, Maryland, Massachusetts, Michigan,
                              Minnesota, Mississippi, Missouri, Montana,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  248.4777 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |        .088
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |        .079
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |        .003
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |        .002
            Missouri |           0
             Montana |           0
            Nebraska |        .055
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |        .244
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |        .074
        South Dakota |           0
           Tennessee |        .031
               Texas |        .099
                Utah |        .096
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |        .229
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      4566   4492.104 
                bmprison(1992) |      5255   5253.678 
                bmprison(1991) |      4687   4722.952 
                bmprison(1988) |      3367   3397.665 
                 alcohol(1990) |      2.09    2.35785 
              aidscapita(1990) |  3.796468   3.772671 
              aidscapita(1991) |   4.66492   4.743975 
                        income |  16019.25   15880.78 
                            ur |  5.883333   5.822328 
                       poverty |   12.5125   13.19742 
                   black(1990) |  7.956117   7.990303 
                   black(1991) |  8.045338   8.050152 
                   black(1992) |  8.168668    8.12702 
                perc1519(1990) |  7.635398   7.602784 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Kansas
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kentucky, Louisiana,
                              Maine, Maryland, Massachusetts, Michigan,
                              Minnesota, Mississippi, Missouri, Montana,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  133.9102 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |        .017
             Arizona |           0
            Arkansas |           0
          California |        .001
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |        .124
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |        .415
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |        .139
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .132
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |        .027
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |        .145
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      1876   1934.432 
                bmprison(1992) |      2112   2203.138 
                bmprison(1991) |      2014   2022.232 
                bmprison(1988) |      1857   1685.929 
                 alcohol(1990) |      1.79    2.38462 
              aidscapita(1990) |  3.828562   3.935118 
              aidscapita(1991) |   5.20266    5.13263 
                        income |  16847.63   16753.46 
                            ur |  4.711458   4.746524 
                       poverty |   10.8375   11.70655 
                   black(1990) |  6.036761   6.016777 
                   black(1991) |    6.0826   6.101855 
                   black(1992) |  6.229799    6.23263 
                perc1519(1990) |    6.9245   7.184362 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Kentucky
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Louisiana, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  82.86875 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |         .15
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |        .002
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |        .193
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
           Louisiana |        .002
               Maine |        .094
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |        .063
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |        .093
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |        .071
           Tennessee |           0
               Texas |        .006
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |        .325
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      2563   2609.288 
                bmprison(1992) |      3140   3136.471 
                bmprison(1991) |      2929   2936.827 
                bmprison(1988) |      2058   2052.786 
                 alcohol(1990) |      1.83     2.0158 
              aidscapita(1990) |  3.275539   3.178186 
              aidscapita(1991) |  3.304384   3.358035 
                        income |  14181.63   14092.95 
                            ur |  7.655208   7.977616 
                       poverty |   17.9875    17.4075 
                   black(1990) |  7.191004   7.161595 
                   black(1991) |  7.211855   7.199536 
                   black(1992) |  7.258577   7.247282 
                perc1519(1990) |   7.69879   7.730112 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Louisiana
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky, Maine,
                              Maryland, Massachusetts, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  938.8049 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .242
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |        .071
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |        .635
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .052
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     12830   13217.72 
                bmprison(1992) |     15303   14292.59 
                bmprison(1991) |     14135    13710.7 
                bmprison(1988) |     11213   10972.49 
                 alcohol(1990) |      2.54    2.41594 
              aidscapita(1990) |  9.806867    15.3929 
              aidscapita(1991) |  11.84968   16.05279 
                        income |  13898.25   14954.55 
                            ur |  9.305208   8.424093 
                       poverty |      22.3   21.36418 
                   black(1990) |  31.76111   31.34901 
                   black(1991) |  32.01483   31.59052 
                   black(1992) |  32.31684   31.82107 
                perc1519(1990) |  7.815504   8.000175 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Maine
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maryland, Massachusetts, Michigan,
                              Minnesota, Mississippi, Missouri, Montana,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  35.34841 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |        .123
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .067
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |        .022
             Vermont |        .788
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |        29     62.234 
                bmprison(1992) |        29     65.631 
                bmprison(1991) |        34     65.004 
                bmprison(1988) |        15     53.604 
                 alcohol(1990) |      2.34    2.68436 
              aidscapita(1990) |  3.491056   2.929644 
              aidscapita(1991) |  2.990912    2.90553 
                        income |     15783    15945.3 
                            ur |  5.342708   5.067096 
                       poverty |   12.2625   10.67668 
                   black(1990) |  .4055487   .4297993 
                   black(1991) |  .4133324   .4427473 
                   black(1992) |  .4155723   .4822107 
                perc1519(1990) |  7.126382   7.414067 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Maryland
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Massachusetts, Michigan,
                              Minnesota, Mississippi, Missouri, Montana,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  615.9429 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .003
            Colorado |           0
         Connecticut |        .038
            Delaware |           0
District of Columbia |        .033
             Florida |        .093
             Georgia |        .318
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |        .089
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |        .358
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |        .067
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     13135   12909.17 
                bmprison(1992) |     14570    14599.3 
                bmprison(1991) |     13946   13920.91 
                bmprison(1988) |     10031   10046.38 
                 alcohol(1990) |      2.51    2.55925 
              aidscapita(1990) |  14.22985   15.12481 
              aidscapita(1991) |  17.79096   17.01542 
                        income |  20890.25   16895.72 
                            ur |  4.845833   5.615918 
                       poverty |    9.5875   14.53475 
                   black(1990) |  26.21613   26.39919 
                   black(1991) |  26.69498   26.61858 
                   black(1992) |  27.14062   26.85301 
                perc1519(1990) |  6.482956   7.367653 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Massachusetts
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Michigan, Minnesota,
                              Mississippi, Missouri, Montana, Nebraska, Nevada,
                              New Hampshire, New Jersey, New Mexico, New York,
                              North Carolina, North Dakota, Ohio, Oklahoma,
                              Oregon, Pennsylvania, Rhode Island, South
                              Carolina, South Dakota, Tennessee, Texas, Utah,
                              Vermont, Virginia, Washington, West Virginia,
                              Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  216.1974 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |        .431
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |        .179
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |        .068
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .275
        Pennsylvania |           0
        Rhode Island |        .046
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      2895   2706.908 
                bmprison(1992) |      3062   3119.297 
                bmprison(1991) |      2899   2940.223 
                bmprison(1988) |      2215   2238.218 
                 alcohol(1990) |      2.63    2.50194 
              aidscapita(1990) |  10.54355   10.82419 
              aidscapita(1991) |  13.59149    12.8388 
                        income |  21166.13   18067.78 
                            ur |  5.361458   5.784729 
                       poverty |    9.4875   11.63031 
                   black(1990) |  5.014848    5.04877 
                   black(1991) |  5.176661   5.185536 
                   black(1992) |  5.330801   5.343489 
                perc1519(1990) |  6.753601   6.744961 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Michigan
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Minnesota, Mississippi, Missouri, Montana,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  747.0685 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |         .18
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |        .163
               Maine |           0
            Maryland |           0
       Massachusetts |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |        .658
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     18616   18107.52 
                bmprison(1992) |     21272   21275.84 
                bmprison(1991) |     19930   20016.15 
                bmprison(1988) |     14939   14611.53 
                 alcohol(1990) |      2.42    2.28964 
              aidscapita(1990) |  4.671733   8.202772 
              aidscapita(1991) |  5.563566   9.217207 
                        income |  17533.75   17132.29 
                            ur |  8.527083   7.275132 
                       poverty |   13.4875   14.24372 
                   black(1990) |  14.39783    14.3216 
                   black(1991) |   14.5297   14.49217 
                   black(1992) |  14.64006   14.68159 
                perc1519(1990) |   7.44888    7.30004 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Minnesota
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Mississippi, Missouri, Montana,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  70.40208 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |        .064
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |        .123
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |        .333
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |        .133
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |        .039
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |        .212
           Tennessee |           0
               Texas |        .004
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |        .092
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |       838     893.43 
                bmprison(1992) |      1126   1113.897 
                bmprison(1991) |       991   1023.792 
                bmprison(1988) |       707    705.919 
                 alcohol(1990) |      2.55    2.73011 
              aidscapita(1990) |  3.804224   3.795706 
              aidscapita(1991) |  4.458597   4.487003 
                        income |  18256.88   17116.14 
                            ur |  5.060417   5.158915 
                       poverty |   12.1375   11.56266 
                   black(1990) |  2.234463   2.291423 
                   black(1991) |  2.343947   2.341616 
                   black(1992) |  2.515478   2.456276 
                perc1519(1990) |  6.795734   6.986278 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Mississippi
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Missouri, Montana, Nebraska,
                              Nevada, New Hampshire, New Jersey, New Mexico, New
                              York, North Carolina, North Dakota, Ohio,
                              Oklahoma, Oregon, Pennsylvania, Rhode Island,
                              South Carolina, South Dakota, Tennessee, Texas,
                              Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  1859.675 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |        .283
District of Columbia |        .196
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |        .521
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      5663   7923.936 
                bmprison(1992) |      6069   8837.421 
                bmprison(1991) |      6055   8456.379 
                bmprison(1988) |      4898    6360.34 
                 alcohol(1990) |      2.08     3.0061 
              aidscapita(1990) |  5.661335   24.12474 
              aidscapita(1991) |  5.849004   24.84331 
                        income |  12036.75   17577.06 
                            ur |  9.372917    5.41775 
                       poverty |   24.9875   14.59007 
                   black(1990) |  35.96339   34.46385 
                   black(1991) |  36.20175   34.73087 
                   black(1992) |  36.46762   34.94319 
                perc1519(1990) |  8.575604   7.368281 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Missouri
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Montana,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  326.8748 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |        .188
              Alaska |           0
             Arizona |           0
            Arkansas |        .008
          California |        .087
            Colorado |           0
         Connecticut |        .005
            Delaware |           0
District of Columbia |        .001
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |        .161
            Kentucky |           0
           Louisiana |        .055
               Maine |           0
            Maryland |        .012
       Massachusetts |           0
            Michigan |           0
           Minnesota |        .026
         Mississippi |           0
             Montana |           0
            Nebraska |        .143
              Nevada |         .02
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |        .004
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .257
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |        .033
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      6531   6530.469 
                bmprison(1992) |      7282   7281.191 
                bmprison(1991) |      6941   6937.102 
                bmprison(1988) |      5369   5366.303 
                 alcohol(1990) |       2.3    2.30113 
              aidscapita(1990) |  6.824102   6.853255 
              aidscapita(1991) |  8.083856   8.118202 
                        income |  16514.88   16505.03 
                            ur |  6.017708   6.037544 
                       poverty |   13.9125   13.86994 
                   black(1990) |  10.94321    10.9826 
                   black(1991) |  11.03806   11.07718 
                   black(1992) |  11.15092   11.20208 
                perc1519(1990) |  7.050974   7.117615 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Montana
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Nebraska, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |    4.4689 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |        .362
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |        .387
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |        .251
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |        20     24.867 
                bmprison(1992) |        24     25.279 
                bmprison(1991) |        19     22.495 
                bmprison(1988) |        17     19.162 
                 alcohol(1990) |      2.67    2.43012 
              aidscapita(1990) |  .6248407   1.417511 
              aidscapita(1991) |  2.717123   1.603347 
                        income |  14240.88   14863.02 
                            ur |  6.759375   5.158263 
                       poverty |    15.775   13.63071 
                   black(1990) |  .2813739   .3852026 
                   black(1991) |  .2870171   .3979133 
                   black(1992) |  .2855483   .4301082 
                perc1519(1990) |  7.154176   7.564864 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Nebraska
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nevada, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  31.63831 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |        .007
            Delaware |        .121
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |        .119
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
              Nevada |           0
       New Hampshire |        .093
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |         .27
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |        .014
        South Dakota |        .374
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |        .002
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |       727    702.062 
                bmprison(1992) |       787    801.471 
                bmprison(1991) |       773    754.364 
                bmprison(1988) |       593    612.003 
                 alcohol(1990) |      2.25    2.59434 
              aidscapita(1990) |   2.14964   2.184729 
              aidscapita(1991) |  2.757032   2.802648 
                        income |   16485.5   15988.63 
                            ur |  3.578125   4.447351 
                       poverty |    11.725   12.37627 
                   black(1990) |   3.74044   3.730473 
                   black(1991) |  3.781481   3.782601 
                   black(1992) |   3.83648   3.860728 
                perc1519(1990) |  7.150842   7.141173 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Nevada
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, New Hampshire, New Jersey, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  144.4991 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |        .101
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |        .042
             Florida |           0
             Georgia |           0
              Hawaii |        .322
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |        .341
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |         .19
            Nebraska |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |        .004
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      1529   1554.015 
                bmprison(1992) |      1622   1669.049 
                bmprison(1991) |      1567   1579.871 
                bmprison(1988) |      1421   1261.586 
                 alcohol(1990) |      4.78    2.83802 
              aidscapita(1990) |  10.15815   10.87167 
              aidscapita(1991) |  14.04136    13.3659 
                        income |  18654.38   19489.24 
                            ur |    6.0625    5.44292 
                       poverty |    11.025   11.45061 
                   black(1990) |  7.536125   7.524781 
                   black(1991) |  7.692786   7.719317 
                   black(1992) |  7.892508     7.9963 
                perc1519(1990) |  6.254142   6.763963 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: New Hampshire
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Jersey, New Mexico,
                              New York, North Carolina, North Dakota, Ohio,
                              Oklahoma, Oregon, Pennsylvania, Rhode Island,
                              South Carolina, South Dakota, Tennessee, Texas,
                              Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  17.44104 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |        .032
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |        .007
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |        .008
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |        .953
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |        56     66.102 
                bmprison(1992) |        78     69.239 
                bmprison(1991) |        79     67.232 
                bmprison(1988) |        32     51.179 
                 alcohol(1990) |       4.3    2.81322 
              aidscapita(1990) |   2.69691   2.743986 
              aidscapita(1991) |  2.883067   2.815239 
                        income |  19349.75   16501.32 
                            ur |  4.384375   4.825501 
                       poverty |       6.4   9.951313 
                   black(1990) |   .621322   .5745419 
                   black(1991) |  .5643912   .5836529 
                   black(1992) |  .5781557   .6363814 
                perc1519(1990) |  6.801698   7.307318 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: New Jersey
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Mexico, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  393.2002 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |         .08
             Florida |        .408
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |        .476
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Mexico |           0
            New York |        .036
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     12856   12772.91 
                bmprison(1992) |     14038   14256.28 
                bmprison(1991) |     14226   13576.39 
                bmprison(1988) |      9393    9628.64 
                 alcohol(1990) |      2.59    2.87356 
              aidscapita(1990) |  22.96803   22.33607 
              aidscapita(1991) |  25.61847   25.51303 
                        income |  22234.25   19964.32 
                            ur |  5.372917   5.889958 
                       poverty |    8.6375   11.98845 
                   black(1990) |  14.85305   14.87646 
                   black(1991) |    15.101   15.11006 
                   black(1992) |  15.36085    15.3411 
                perc1519(1990) |  6.539088   6.520982 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: New Mexico
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New York, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  23.51869 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |        .021
             Florida |           0
             Georgia |           0
              Hawaii |        .089
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |        .467
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |         .03
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |        .392
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |       295     323.36 
                bmprison(1992) |       339    354.346 
                bmprison(1991) |       300    328.557 
                bmprison(1988) |       284    291.802 
                 alcohol(1990) |      2.64    2.33613 
              aidscapita(1990) |  4.534778   4.333467 
              aidscapita(1991) |  5.786646   5.544074 
                        income |     13909    14571.1 
                            ur |  7.821875   7.977687 
                       poverty |    20.825   16.76032 
                   black(1990) |  3.501076   3.509374 
                   black(1991) |   3.57477   3.553239 
                   black(1992) |  3.658733   3.607647 
                perc1519(1990) |  7.530229   7.351371 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: New York
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, North Carolina, North Dakota,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  1745.408 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .746
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |        .102
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |        .152
          New Mexico |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     26026    26908.5 
                bmprison(1992) |     29314    28725.5 
                bmprison(1991) |     27438    27736.5 
                bmprison(1988) |     21495   21987.39 
                 alcohol(1990) |       2.3    2.88984 
              aidscapita(1990) |  36.10831   27.52627 
              aidscapita(1991) |  41.16979   29.43786 
                        income |  21170.75   20608.42 
                            ur |  6.044792   6.460956 
                       poverty |    14.325   13.43725 
                   black(1990) |  17.19302   17.70221 
                   black(1991) |  17.47114   17.92493 
                   black(1992) |  17.73805   18.10262 
                perc1519(1990) |  6.821485   6.852489 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: North Carolina
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Dakota, Ohio,
                              Oklahoma, Oregon, Pennsylvania, Rhode Island,
                              South Carolina, South Dakota, Tennessee, Texas,
                              Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  1153.701 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |        .187
            Kentucky |           0
           Louisiana |        .203
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |        .322
           Minnesota |           0
         Mississippi |        .288
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     10500    10580.6 
                bmprison(1992) |     12167   12098.91 
                bmprison(1991) |     10939   11407.32 
                bmprison(1988) |      9256    8844.48 
                 alcohol(1990) |      2.08    2.22863 
              aidscapita(1990) |  4.921957   5.841498 
              aidscapita(1991) |   6.95726   6.854364 
                        income |  15768.25    15084.3 
                            ur |  4.909375   8.215121 
                       poverty |      13.8   18.09289 
                   black(1990) |  22.62282   22.56994 
                   black(1991) |  22.75227   22.74112 
                   black(1992) |  22.90277   22.94207 
                perc1519(1990) |  7.475462   7.749742 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: North Dakota
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              Ohio, Oklahoma, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  29.41804 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |        .803
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |        .197
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |         5      40.97 
                bmprison(1992) |         7     42.379 
                bmprison(1991) |         4     34.349 
                bmprison(1988) |         7     32.728 
                 alcohol(1990) |      2.56    2.39713 
              aidscapita(1990) |         0          0 
              aidscapita(1991) |         0   1.056184 
                        income |  14596.75   14949.47 
                            ur |  4.859375   4.621131 
                       poverty |   13.1125   14.16882 
                   black(1990) |  .5434442   .5366836 
                   black(1991) |  .5540718   .5417486 
                   black(1992) |  .5601935   .5839417 
                perc1519(1990) |  7.274281   7.355324 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Ohio
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Oklahoma, Oregon, Pennsylvania,
                              Rhode Island, South Carolina, South Dakota,
                              Tennessee, Texas, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  818.8262 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .111
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |        .538
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |         .23
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .121
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     15535   16328.36 
                bmprison(1992) |     19166   18586.64 
                bmprison(1991) |     17896   17197.28 
                bmprison(1988) |     12196   13025.09 
                 alcohol(1990) |      2.09    2.49821 
              aidscapita(1990) |  4.473424    6.41523 
              aidscapita(1991) |  4.942552   7.275569 
                        income |     17149   16948.97 
                            ur |  6.933333   7.341466 
                       poverty |   12.3375   13.88931 
                   black(1990) |  10.86035   11.05809 
                   black(1991) |  11.01115   11.16755 
                   black(1992) |  11.18201   11.26478 
                perc1519(1990) |  7.260128   7.382831 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Oklahoma
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oregon, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  122.3218 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |        .201
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |        .081
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |        .198
              Kansas |        .011
            Kentucky |           0
           Louisiana |         .08
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |        .243
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |        .008
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .082
                Utah |        .049
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |        .047
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      3793   3834.961 
                bmprison(1992) |      4644   4644.176 
                bmprison(1991) |      4090   4111.654 
                bmprison(1988) |      3003   2999.526 
                 alcohol(1990) |      1.81    2.25609 
              aidscapita(1990) |  4.065008   4.170057 
              aidscapita(1991) |  5.888947   5.801926 
                        income |  14961.75   14967.84 
                            ur |  6.721875   6.752744 
                       poverty |   16.3625   15.99766 
                   black(1990) |  8.349623   8.369112 
                   black(1991) |  8.449389    8.45356 
                   black(1992) |  8.598907   8.568821 
                perc1519(1990) |   7.40905   7.415409 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Oregon
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Pennsylvania, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  58.99129 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |        .059
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |        .331
            Maryland |           0
       Massachusetts |         .23
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
                Utah |        .379
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |       811    844.256 
                bmprison(1992) |       855    915.353 
                bmprison(1991) |       849    862.736 
                bmprison(1988) |       703    650.219 
                 alcohol(1990) |      2.51    2.04726 
              aidscapita(1990) |  7.411615    5.61991 
              aidscapita(1991) |  8.024567   6.542895 
                        income |  16396.38   16409.13 
                            ur |  6.654167   5.374221 
                       poverty |   11.7625   10.84102 
                   black(1990) |   1.72289   1.820266 
                   black(1991) |  1.764278   1.873457 
                   black(1992) |  1.785393   1.923581 
                perc1519(1990) |  6.714609   7.683252 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Pennsylvania
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon, Rhode
                              Island, South Carolina, South Dakota, Tennessee,
                              Texas, Utah, Vermont, Virginia, Washington, West
                              Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  354.1525 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .198
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |        .115
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |        .013
      North Carolina |          .1
        North Dakota |           0
                Ohio |        .156
            Oklahoma |           0
              Oregon |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .013
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |        .405
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     11672   11822.51 
                bmprison(1992) |     13542   13505.06 
                bmprison(1991) |     12510   12581.39 
                bmprison(1988) |      9785   9685.138 
                 alcohol(1990) |      2.15    2.59569 
              aidscapita(1990) |  7.510523   7.351943 
              aidscapita(1991) |  8.354084   8.510827 
                        income |  17833.63   17363.61 
                            ur |  6.296875    5.80796 
                       poverty |    10.725   11.62911 
                   black(1990) |  9.369183   9.371784 
                   black(1991) |  9.494781   9.501306 
                   black(1992) |  9.657706   9.641107 
                perc1519(1990) |  6.846211   7.105746 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: South Carolina
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Dakota,
                              Tennessee, Texas, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  597.2221 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |        .006
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |        .062
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |        .146
               Maine |           0
            Maryland |        .145
       Massachusetts |           0
            Michigan |        .051
           Minnesota |           0
         Mississippi |         .52
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .069
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     10598   10382.26 
                bmprison(1992) |     11857    11856.3 
                bmprison(1991) |     11410    11093.8 
                bmprison(1988) |      8131   8417.916 
                 alcohol(1990) |      2.61    2.29044 
              aidscapita(1990) |  7.854551   8.279351 
              aidscapita(1991) |  9.242652    9.47206 
                        income |  14343.13   14610.96 
                            ur |  5.597917   8.377168 
                       poverty |    16.525    20.4598 
                   black(1990) |  30.27401   30.09735 
                   black(1991) |  30.37216   30.35676 
                   black(1992) |  30.52598   30.63465 
                perc1519(1990) |   7.88614   7.930447 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: South Dakota
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina,
                              Tennessee, Texas, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  3.083115 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |         .32
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |        .678
                Ohio |        .001
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
           Tennessee |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |        39     25.325 
                bmprison(1992) |        41     31.592 
                bmprison(1991) |        31     26.688 
                bmprison(1988) |        28     22.382 
                 alcohol(1990) |      2.34    2.59217 
              aidscapita(1990) |         0   .2044224 
              aidscapita(1991) |  .9947859   .8744218 
                        income |  14632.13   14470.83 
                            ur |  4.120833    5.46459 
                       poverty |   14.9125   13.95061 
                   black(1990) |  .4709323   .4693551 
                   black(1991) |  .4792899   .4785173 
                   black(1992) |   .522674   .4823687 
                perc1519(1990) |  7.267527   7.228559 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Tennessee
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Texas, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  232.7733 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |        .801
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |        .054
               Idaho |           0
            Illinois |        .007
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
               Texas |           0
                Utah |           0
             Vermont |           0
            Virginia |        .138
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      4428   4508.263 
                bmprison(1992) |      5586   5487.829 
                bmprison(1991) |      5287    5142.35 
                bmprison(1988) |      2972   3347.813 
                 alcohol(1990) |      1.96     1.9624 
              aidscapita(1990) |  4.372262   4.141545 
              aidscapita(1991) |  5.476598    5.64903 
                        income |  15309.13   14559.43 
                            ur |  6.569792   7.012799 
                       poverty |   17.3875   18.11552 
                   black(1990) |  16.15927   16.16739 
                   black(1991) |  16.26023   16.25364 
                   black(1992) |  16.39608   16.38502 
                perc1519(1990) |  7.455708     7.4725 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Texas
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  1295.489 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |        .408
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |        .109
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |         .36
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |        .122
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
                Utah |           0
             Vermont |           0
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     22634    23134.8 
                bmprison(1992) |     27568   25776.34 
                bmprison(1991) |     23249   24272.24 
                bmprison(1988) |     16956   18374.28 
                 alcohol(1990) |      2.47    2.70996 
              aidscapita(1990) |  13.58992   14.99957 
              aidscapita(1991) |  14.83504   17.24535 
                        income |  16108.63   18614.54 
                            ur |  7.426042   7.188876 
                       poverty |      17.2   14.86484 
                   black(1990) |  16.15459   15.98038 
                   black(1991) |  16.29985   16.16835 
                   black(1992) |  16.45955   16.37467 
                perc1519(1990) |  7.703001   7.022702 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Utah
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Texas, Vermont, Virginia,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  26.49984 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |         .22
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |        .092
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .274
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |           0
             Vermont |        .415
            Virginia |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |       208    230.822 
                bmprison(1992) |       234    242.658 
                bmprison(1991) |       207    242.134 
                bmprison(1988) |       167    199.062 
                 alcohol(1990) |      1.39    2.56442 
              aidscapita(1990) |  3.870096   3.910472 
              aidscapita(1991) |  4.551124   3.906712 
                        income |     13865   15799.68 
                            ur |  5.294792   5.710708 
                       poverty |    10.275   11.73907 
                   black(1990) |  .6867507   .7187379 
                   black(1991) |  .7101454   .7389588 
                   black(1992) |  .7394558   .7663278 
                perc1519(1990) |  8.887128   7.308538 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Virginia
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Texas, Utah, Vermont,
                              Washington, West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  244.9428 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |        .124
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |        .031
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |        .119
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |           0
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |        .321
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |        .279
        South Dakota |           0
           Tennessee |        .126
               Texas |           0
                Utah |           0
             Vermont |           0
          Washington |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |     10617   10828.04 
                bmprison(1992) |     12896   12807.84 
                bmprison(1991) |     12109   12079.86 
                bmprison(1988) |      8239   8348.903 
                 alcohol(1990) |      2.18    2.39175 
              aidscapita(1990) |  7.238353   7.452047 
              aidscapita(1991) |  8.649123   8.644279 
                        income |  18808.25    16935.5 
                            ur |  4.848958   5.938224 
                       poverty |    10.225   13.43821 
                   black(1990) |  19.73318   19.75638 
                   black(1991) |  19.97023   19.95071 
                   black(1992) |  20.26208   20.16326 
                perc1519(1990) |  7.049963   7.316102 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Washington
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Texas, Utah, Vermont, Virginia,
                              West Virginia, Wisconsin, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  165.9772 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |           0
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |        .515
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |         .02
            Nebraska |           0
              Nevada |           0
       New Hampshire |        .155
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |           0
        North Dakota |           0
                Ohio |           0
            Oklahoma |           0
              Oregon |        .284
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |           0
               Texas |        .027
                Utah |           0
             Vermont |           0
            Virginia |           0
       West Virginia |           0
           Wisconsin |           0
             Wyoming |           0
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      1489   1635.897 
                bmprison(1992) |      2036   1984.406 
                bmprison(1991) |      1810   1808.979 
                bmprison(1988) |      1225   1295.699 
                 alcohol(1990) |      2.49    2.73028 
              aidscapita(1990) |  7.770684   7.900352 
              aidscapita(1991) |  9.491359   9.308219 
                        income |  18061.75   17644.76 
                            ur |   6.79375   6.099125 
                       poverty |     10.35   11.27314 
                   black(1990) |  3.367203    3.40458 
                   black(1991) |  3.434574   3.451091 
                   black(1992) |  3.526803   3.488134 
                perc1519(1990) |  6.663495    6.82885 
------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------
                Treated Unit: Wisconsin
               Control Units: Alabama, Alaska, Arizona, Arkansas, California,
                              Colorado, Connecticut, Delaware, District of
                              Columbia, Florida, Georgia, Hawaii, Idaho,
                              Illinois, Indiana, Iowa, Kansas, Kentucky,
                              Louisiana, Maine, Maryland, Massachusetts,
                              Michigan, Minnesota, Mississippi, Missouri,
                              Montana, Nebraska, Nevada, New Hampshire, New
                              Jersey, New Mexico, New York, North Carolina,
                              North Dakota, Ohio, Oklahoma, Oregon,
                              Pennsylvania, Rhode Island, South Carolina, South
                              Dakota, Tennessee, Texas, Utah, Vermont, Virginia,
                              Washington, West Virginia, Wyoming
--------------------------------------------------------------------------------
          Dependent Variable: bmprison
  MSPE minimized for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993
Results obtained for periods: 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994
                              1995 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------
                  Predictors: bmprison(1990) bmprison(1992) bmprison(1991)
                              bmprison(1988) alcohol(1990) aidscapita(1990)
                              aidscapita(1991) income ur poverty black(1990)
                              black(1991) black(1992) perc1519(1990)
--------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1985 1986 1987 1988 1989 1990 1991 1992
--------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  124.5507 
---------------------
--------------------------------------------------------------------------------
Unit Weights:

----------------------------------
               Co_No | Unit_Weight
---------------------+------------
             Alabama |           0
              Alaska |        .016
             Arizona |           0
            Arkansas |           0
          California |           0
            Colorado |           0
         Connecticut |           0
            Delaware |           0
District of Columbia |           0
             Florida |           0
             Georgia |           0
              Hawaii |           0
               Idaho |           0
            Illinois |           0
             Indiana |           0
                Iowa |           0
              Kansas |           0
            Kentucky |           0
           Louisiana |           0
               Maine |           0
            Maryland |           0
       Massachusetts |           0
            Michigan |           0
           Minnesota |           0
         Mississippi |           0
            Missouri |           0
             Montana |           0
            Nebraska |           0
              Nevada |           0
       New Hampshire |        .262
          New Jersey |           0
          New Mexico |           0
            New York |           0
      North Carolina |        .011
        North Dakota |        .334
                Ohio |        .007
            Oklahoma |           0
              Oregon |           0
        Pennsylvania |           0
        Rhode Island |           0
      South Carolina |           0
        South Dakota |           0
           Tennessee |        .105
               Texas |        .059
                Utah |           0
             Vermont |           0
            Virginia |        .088
          Washington |           0
       West Virginia |           0
             Wyoming |        .118
----------------------------------
--------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                bmprison(1990) |      2783   2985.619 
                bmprison(1992) |      3775   3649.559 
                bmprison(1991) |      3148   3270.741 
                bmprison(1988) |      2244   2245.878 
                 alcohol(1990) |      3.07    2.92614 
              aidscapita(1990) |  2.589426   2.718832 
              aidscapita(1991) |  3.162554     3.2854 
                        income |   16662.5   16709.65 
                            ur |  5.438542   5.356476 
                       poverty |       9.7   11.52305 
                   black(1990) |  5.158698   5.231071 
                   black(1991) |  5.280403   5.259907 
                   black(1992) |  5.391706   5.325525 
                perc1519(1990) |  7.078125    7.22198 
------------------------------------------------------
--------------------------------------------------------------------------------

.  foreach i of local statelist {;
  2.  matrix rownames state`i'=`i';
  3.  matlist state`i', names(rows);
  4.  };

           1 |  363.9074 

           2 |  224.5887 

           4 |  58.05471 

           5 |  241.5296 

           6 |  5416.415 

           8 |  222.9233 

           9 |  312.2713 

          10 |  150.1067 

          11 |  3174.297 

          12 |  652.9261 

          13 |  277.6978 

          15 |  662.0145 

          16 |  13.50596 

          17 |   334.531 

          18 |  248.4777 

          20 |  133.9102 

          21 |  82.86875 

          22 |  938.8049 

          23 |  35.34841 

          24 |  615.9429 

          25 |  216.1974 

          26 |  747.0685 

          27 |  70.40208 

          28 |  1859.675 

          29 |  326.8748 

          30 |    4.4689 

          31 |  31.63831 

          32 |  144.4991 

          33 |  17.44104 

          34 |  393.2002 

          35 |  23.51869 

          36 |  1745.408 

          37 |  1153.701 

          38 |  29.41804 

          39 |  818.8262 

          40 |  122.3218 

          41 |  58.99129 

          42 |  354.1525 

          45 |  597.2221 

          46 |  3.083115 

          47 |  232.7733 

          48 |  1295.489 

          49 |  26.49984 

          51 |  244.9428 

          53 |  165.9772 

          55 |  124.5507 

.  #delimit cr
delimiter now cr
. local statelist  1 2 4 5 6 8 9 10 11 12 13 15 16 17 18 20 21 22 23 24 25 26 27
>  28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 45 46 47 48 49 51 53 55

. 
.  foreach i of local statelist {
  2.         use ../data/synth/synth_bmprate_`i' ,clear
  3.         keep _Y_treated _Y_synthetic _time
  4.         drop if _time==.
  5.         rename _time year
  6.         rename _Y_treated  treat`i'
  7.         rename _Y_synthetic counterfact`i'
  8.         gen gap`i'=treat`i'-counterfact`i'
  9.         sort year 
 10.         save ../data/synth/synth_gap_bmprate`i', replace
 11. }
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate1.dta not found)
file ../data/synth/synth_gap_bmprate1.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate2.dta not found)
file ../data/synth/synth_gap_bmprate2.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate4.dta not found)
file ../data/synth/synth_gap_bmprate4.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate5.dta not found)
file ../data/synth/synth_gap_bmprate5.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate6.dta not found)
file ../data/synth/synth_gap_bmprate6.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate8.dta not found)
file ../data/synth/synth_gap_bmprate8.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate9.dta not found)
file ../data/synth/synth_gap_bmprate9.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate10.dta not found)
file ../data/synth/synth_gap_bmprate10.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate11.dta not found)
file ../data/synth/synth_gap_bmprate11.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate12.dta not found)
file ../data/synth/synth_gap_bmprate12.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate13.dta not found)
file ../data/synth/synth_gap_bmprate13.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate15.dta not found)
file ../data/synth/synth_gap_bmprate15.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate16.dta not found)
file ../data/synth/synth_gap_bmprate16.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate17.dta not found)
file ../data/synth/synth_gap_bmprate17.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate18.dta not found)
file ../data/synth/synth_gap_bmprate18.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate20.dta not found)
file ../data/synth/synth_gap_bmprate20.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate21.dta not found)
file ../data/synth/synth_gap_bmprate21.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate22.dta not found)
file ../data/synth/synth_gap_bmprate22.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate23.dta not found)
file ../data/synth/synth_gap_bmprate23.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate24.dta not found)
file ../data/synth/synth_gap_bmprate24.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate25.dta not found)
file ../data/synth/synth_gap_bmprate25.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate26.dta not found)
file ../data/synth/synth_gap_bmprate26.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate27.dta not found)
file ../data/synth/synth_gap_bmprate27.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate28.dta not found)
file ../data/synth/synth_gap_bmprate28.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate29.dta not found)
file ../data/synth/synth_gap_bmprate29.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate30.dta not found)
file ../data/synth/synth_gap_bmprate30.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate31.dta not found)
file ../data/synth/synth_gap_bmprate31.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate32.dta not found)
file ../data/synth/synth_gap_bmprate32.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate33.dta not found)
file ../data/synth/synth_gap_bmprate33.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate34.dta not found)
file ../data/synth/synth_gap_bmprate34.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate35.dta not found)
file ../data/synth/synth_gap_bmprate35.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate36.dta not found)
file ../data/synth/synth_gap_bmprate36.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate37.dta not found)
file ../data/synth/synth_gap_bmprate37.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate38.dta not found)
file ../data/synth/synth_gap_bmprate38.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate39.dta not found)
file ../data/synth/synth_gap_bmprate39.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate40.dta not found)
file ../data/synth/synth_gap_bmprate40.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate41.dta not found)
file ../data/synth/synth_gap_bmprate41.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate42.dta not found)
file ../data/synth/synth_gap_bmprate42.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate45.dta not found)
file ../data/synth/synth_gap_bmprate45.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate46.dta not found)
file ../data/synth/synth_gap_bmprate46.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate47.dta not found)
file ../data/synth/synth_gap_bmprate47.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate48.dta not found)
file ../data/synth/synth_gap_bmprate48.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate49.dta not found)
file ../data/synth/synth_gap_bmprate49.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate51.dta not found)
file ../data/synth/synth_gap_bmprate51.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate53.dta not found)
file ../data/synth/synth_gap_bmprate53.dta saved
(34 observations deleted)
(file ../data/synth/synth_gap_bmprate55.dta not found)
file ../data/synth/synth_gap_bmprate55.dta saved

. 
. use ../data/synth/synth_gap_bmprate48.dta, clear

. sort year

. save ../data/synth/placebo_bmprate48.dta, replace
(file ../data/synth/placebo_bmprate48.dta not found)
file ../data/synth/placebo_bmprate48.dta saved

. 
. foreach i of local statelist {
  2.                 
.                 merge year using ../data/synth/synth_gap_bmprate`i'
  3.                 drop _merge
  4.                 sort year
  5.                 
.         save ../data/synth/placebo_bmprate.dta, replace
  6. }
(you are using old merge syntax; see [D] merge for new syntax)
(file ../data/synth/placebo_bmprate.dta not found)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved
(you are using old merge syntax; see [D] merge for new syntax)
file ../data/synth/placebo_bmprate.dta saved

. 
. ** Inference 2: Estimate the pre- and post-RMSPE and calculate the ratio of th
> e
. *  post-pre RMSPE       
. set more off

. local statelist  1 2 4 5 6 8 9 10 11 12 13 15 16 17 18 20 21 22 23 24 25 26 27
>  28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 45 46 47 48 49 51 53 55

. 
. foreach i of local statelist {
  2.         use ../data/synth/synth_gap_bmprate`i', clear
  3.         
.         gen gap3=gap`i'*gap`i'
  4.         egen postmean=mean(gap3) if year>1993
  5.         egen premean=mean(gap3) if year<=1993
  6.         gen rmspe=sqrt(premean) if year<=1993
  7.         replace rmspe=sqrt(postmean) if year>1993
  8.         gen ratio=rmspe/rmspe[_n-1] if year==1994
  9.         gen rmspe_post=sqrt(postmean) if year>1993
 10.         gen rmspe_pre=rmspe[_n-1] if year==1994
 11.         
.         mkmat rmspe_pre rmspe_post ratio if year==1994, matrix (state`i')
 12.                                                                 }
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)
(9 missing values generated)
(7 missing values generated)
(7 missing values generated)
(7 real changes made)
(15 missing values generated)
(9 missing values generated)
(15 missing values generated)

. 
. * show post/pre-expansion RMSPE ratio for all states, generate histogram
. foreach i of local statelist {
  2.         matrix rownames state`i'=`i'
  3.         matlist state`i', names(rows)
  4.                                                                 }

           1 |  364.0713    609.437   1.673949 

           2 |  226.2713   509.7987   2.253042 

           4 |  62.52096   780.5864   12.48519 

           5 |  241.2499   2185.033   9.057136 

           6 |  5415.661   8747.888   1.615295 

           8 |  223.9316   798.1048   3.564056 

           9 |   309.858   1593.791   5.143618 

          10 |    146.97   580.5818   3.950343 

          11 |  3174.297   2804.494   .8835008 

          12 |  652.9641   7387.236   11.31339 

          13 |   286.478   2164.372   7.555109 

          15 |  661.5494    723.535   1.093698 

          16 |  13.50008    19.5467   1.447895 

          17 |  342.8073   6522.212   19.02588 

          18 |  248.2455   1766.239    7.11489 

          20 |  135.5885    424.485   3.130685 

          21 |  86.01774   636.2717   7.396983 

          22 |   936.678   794.8517   .8485858 

          23 |  35.28753   68.66077   1.945752 

          24 |  617.9661   2657.697   4.300716 

          25 |  217.5993   1005.287   4.619901 

          26 |  753.3348   3169.099    4.20676 

          27 |  70.51402   409.5385   5.807901 

          28 |  1859.756   1745.034   .9383135 

          29 |  326.4826   669.5276    2.05073 

          30 |  4.464684   24.09889   5.397671 

          31 |  31.29417    170.496    5.44817 

          32 |  145.9693   598.7559    4.10193 

          33 |  16.97861   34.37054   2.024344 

          34 |  394.2715    782.856   1.985576 

          35 |  21.58923   54.97401   2.546363 

          36 |  1742.419   2397.838   1.376154 

          37 |   1155.54   3149.381   2.725461 

          38 |  29.41692   53.95712   1.834221 

          39 |  816.8444   1872.941   2.292898 

          40 |  123.0832    1627.01   13.21878 

          41 |   58.9625   69.51026   1.178889 

          42 |  353.9792   1062.866   3.002624 

          45 |  589.5134   4355.918   7.389006 

          46 |  7.950802   29.23224   3.676641 

          47 |  232.4188   2596.565   11.17192 

          48 |  1296.272   23569.02   18.18215 

          49 |  26.65721   40.12097    1.50507 

          51 |  243.5752   2342.066    9.61537 

          53 |  165.8011   584.9407   3.527965 

          55 |  123.2012   1489.104   12.08677 

. 
. * ssc install mat2txt, replace
. 
.         mat state=state1\state2\state4\state5\state6\state8\state9\state10\sta
> te11\state12\state13\state15\state16\state17\state18\state20\state21\state22\s
> tate23\state24\state25\state26\state27\state28\state29\state30\state31\state32
> \state33\state34\state35\state36\state37\state38\state39\state40\state41\state
> 42\state45\state46\state47\state48\state49\state51\state53\state55

.         mat2txt, matrix(state) saving(../inference/rmspe_bmprate.txt) replace
(file ../inference/rmspe_bmprate.txt not found)

.         insheet using ../inference/rmspe_bmprate.txt, clear
(5 vars, 46 obs)

.         ren v1 state

.         drop v5

.         gsort -ratio

.         gen rank=_n

.         gen p=rank/46

.         
.         export excel using ../inference/rmspe_bmprate, firstrow(variables) rep
> lace
file ../inference/rmspe_bmprate.xls saved

. 
.         import excel ../inference/rmspe_bmprate.xls, sheet("Sheet1") firstrow 
> clear
(6 vars, 46 obs)

.         histogram ratio, bin(20) frequency fcolor(gs13) lcolor(black) ylabel(0
> (2)12) xtitle(Post/pre RMSPE ratio) xlabel(0(1)25)
(bin=20, start=.84858584, width=.90886494)

. 
. * Show the post/pre RMSPE ratio for all states, generate the histogram.
. list rank p if state==48

     +------------------+
     | rank           p |
     |------------------|
  2. |    2   .04347826 |
     +------------------+

. 
. 
. * Inference 3: all the placeboes on the same picture
. use ../data/synth/placebo_bmprate.dta, replace

. 
. * Picture of the full sample, including outlier RSMPE
. #delimit;       
delimiter now ;
. twoway 
> (line gap1 year ,lp(solid)lw(vthin)) 
> (line gap2 year ,lp(solid)lw(vthin)) 
> (line gap4 year ,lp(solid)lw(vthin)) 
> (line gap5 year ,lp(solid)lw(vthin))
> (line gap6 year ,lp(solid)lw(vthin)) 
> (line gap8 year ,lp(solid)lw(vthin)) 
> (line gap9 year ,lp(solid)lw(vthin)) 
> (line gap10 year ,lp(solid)lw(vthin)) 
> (line gap11 year ,lp(solid)lw(vthin)) 
> (line gap12 year ,lp(solid)lw(vthin)) 
> (line gap13 year ,lp(solid)lw(vthin)) 
> (line gap15 year ,lp(solid)lw(vthin)) 
> (line gap16 year ,lp(solid)lw(vthin)) 
> (line gap17 year ,lp(solid)lw(vthin))
> (line gap18 year ,lp(solid)lw(vthin)) 
> (line gap20 year ,lp(solid)lw(vthin)) 
> (line gap21 year ,lp(solid)lw(vthin)) 
> (line gap22 year ,lp(solid)lw(vthin)) 
> (line gap23 year ,lp(solid)lw(vthin)) 
> (line gap24 year ,lp(solid)lw(vthin)) 
> (line gap25 year ,lp(solid)lw(vthin)) 
> (line gap26 year ,lp(solid)lw(vthin))
> (line gap27 year ,lp(solid)lw(vthin))
> (line gap28 year ,lp(solid)lw(vthin)) 
> (line gap29 year ,lp(solid)lw(vthin)) 
> (line gap30 year ,lp(solid)lw(vthin)) 
> (line gap31 year ,lp(solid)lw(vthin)) 
> (line gap32 year ,lp(solid)lw(vthin)) 
> (line gap33 year ,lp(solid)lw(vthin)) 
> (line gap34 year ,lp(solid)lw(vthin))
> (line gap35 year ,lp(solid)lw(vthin))
> (line gap36 year ,lp(solid)lw(vthin))
> (line gap37 year ,lp(solid)lw(vthin)) 
> (line gap38 year ,lp(solid)lw(vthin)) 
> (line gap39 year ,lp(solid)lw(vthin))
> (line gap40 year ,lp(solid)lw(vthin)) 
> (line gap41 year ,lp(solid)lw(vthin)) 
> (line gap42 year ,lp(solid)lw(vthin)) 
> (line gap45 year ,lp(solid)lw(vthin)) 
> (line gap46 year ,lp(solid)lw(vthin)) 
> (line gap47 year ,lp(solid)lw(vthin))
> (line gap49 year ,lp(solid)lw(vthin)) 
> (line gap51 year ,lp(solid)lw(vthin)) 
> (line gap53 year ,lp(solid)lw(vthin)) 
> (line gap55 year ,lp(solid)lw(vthin)) 
> (line gap48 year ,lp(solid)lw(thick)lcolor(black)), /*treatment unit, Texas*/
> yline(0, lpattern(shortdash) lcolor(black)) xline(1993, lpattern(shortdash) lc
> olor(black))
> xtitle("",si(small)) xlabel(#10) ytitle("Gap in black male prisoners per capit
> a prediction error", size(small))
>         legend(off);

. #delimit cr
delimiter now cr
. 
. graph save Graph ../Figures/synth_placebo_bmprate.gph, replace
(file ../Figures/synth_placebo_bmprate.gph not found)
file ../Figures/synth_placebo_bmprate.gph saved

. 
. * Drop the outliers (RMSPE is 5 times more than Texas: drops 11, 28, 32, 33, a
> nd 41)
. * Picture of the full sample, including outlier RSMPE
. #delimit;       
delimiter now ;
. twoway 
> (line gap1 year ,lp(solid)lw(vthin)) 
> (line gap2 year ,lp(solid)lw(vthin)) 
> (line gap4 year ,lp(solid)lw(vthin)) 
> (line gap5 year ,lp(solid)lw(vthin))
> (line gap6 year ,lp(solid)lw(vthin)) 
> (line gap8 year ,lp(solid)lw(vthin)) 
> (line gap9 year ,lp(solid)lw(vthin)) 
> (line gap10 year ,lp(solid)lw(vthin)) 
> (line gap12 year ,lp(solid)lw(vthin)) 
> (line gap13 year ,lp(solid)lw(vthin)) 
> (line gap15 year ,lp(solid)lw(vthin)) 
> (line gap16 year ,lp(solid)lw(vthin)) 
> (line gap17 year ,lp(solid)lw(vthin))
> (line gap18 year ,lp(solid)lw(vthin)) 
> (line gap20 year ,lp(solid)lw(vthin)) 
> (line gap21 year ,lp(solid)lw(vthin)) 
> (line gap22 year ,lp(solid)lw(vthin)) 
> (line gap23 year ,lp(solid)lw(vthin)) 
> (line gap24 year ,lp(solid)lw(vthin)) 
> (line gap25 year ,lp(solid)lw(vthin)) 
> (line gap26 year ,lp(solid)lw(vthin))
> (line gap27 year ,lp(solid)lw(vthin))
> (line gap29 year ,lp(solid)lw(vthin)) 
> (line gap30 year ,lp(solid)lw(vthin)) 
> (line gap31 year ,lp(solid)lw(vthin)) 
> (line gap34 year ,lp(solid)lw(vthin))
> (line gap35 year ,lp(solid)lw(vthin))
> (line gap36 year ,lp(solid)lw(vthin))
> (line gap37 year ,lp(solid)lw(vthin)) 
> (line gap38 year ,lp(solid)lw(vthin)) 
> (line gap39 year ,lp(solid)lw(vthin))
> (line gap40 year ,lp(solid)lw(vthin)) 
> (line gap42 year ,lp(solid)lw(vthin)) 
> (line gap45 year ,lp(solid)lw(vthin)) 
> (line gap46 year ,lp(solid)lw(vthin)) 
> (line gap47 year ,lp(solid)lw(vthin))
> (line gap49 year ,lp(solid)lw(vthin)) 
> (line gap51 year ,lp(solid)lw(vthin)) 
> (line gap53 year ,lp(solid)lw(vthin)) 
> (line gap55 year ,lp(solid)lw(vthin)) 
> (line gap48 year ,lp(solid)lw(thick)lcolor(black)), /*treatment unit, Texas*/
> yline(0, lpattern(shortdash) lcolor(black)) xline(1993, lpattern(shortdash) lc
> olor(black))
> xtitle("",si(small)) xlabel(#10) ytitle("Gap in black male prisoners per capit
> a prediction error", size(small))
>         legend(off);

. #delimit cr
delimiter now cr
. 
. graph save Graph ../Figures/synth_placebo_bmprate2.gph, replace
(file ../Figures/synth_placebo_bmprate2.gph not found)
file ../Figures/synth_placebo_bmprate2.gph saved

. 
. 
. 
. * Just compare Illinois with Texas
. 
. #delimit;       
delimiter now ;
. twoway 
> (line gap17 year ,lp(solid)lw(vthin))
> (line gap48 year ,lp(solid)lw(thick)lcolor(black)), /*treatment unit, Texas*/
> yline(0, lpattern(shortdash) lcolor(black)) xline(1993, lpattern(shortdash) lc
> olor(black))
> xtitle("",si(small)) xlabel(#10) ytitle("Gap in black male prisoners per capit
> a prediction error", size(small))
>         legend(off);

. #delimit cr
delimiter now cr
. capture log close
